We're off to the witch
We may never, never, never, come home
But the magic that we'll feel
Is worth a lifetime
-Dio
--The Last In Line

Always in focus
You can't feel my stare
I zoom into you
But you don't know I'm there
-Judas Priest
--Electric Eye

Our only master with fire and fury
Of Hell will see his bidding done
Blasting from high as the battle unfolds
To the gates of the city we come
-DragonForce
--Soldiers Of The Wasteland

I wanna see your face, painted black
Black as night, black as coal
I wanna see the sun blotted out from the sky
I wanna see it painted, painted black, yeah
-The Rolling Stones
--Paint It Black

Girl, you really got me now
You got me so I don't know what I'm doin'
Girl, you really got me now
You got me so I can't sleep at night
-You Really Got Me
--Van Halen

And we fall through the dark of the underworld
And we're leaving the light of the day
And I know we will go to the other side
And it seems like I'm going to stay
-Blood Religion
--Gamma Ray


The priest is raising hands to do the final execution
Shouting out in agony, "Fear the cross!"
I'm digging my claws into his neck and raise him to the ceiling
Gritting my teeth I smell the blood, you are lost
-Blood Religion
--Gamma Ray

And in the master's chambers
They gathered for the feast
They stab it with their steely knives
But they just can't kill the beast
-Eagles
--Hotel California

I'm waiting in my cold cell, when the bell begins to chime
Reflecting on my past life and it doesn't have much time
'Cause at 5 o'clock they take me to the gallows pole
The sands of time for me are running low, running low, yeah!
-Hallowed Be Thy Name
--Iron Maiden

Mark my words believe my soul lives on
Don't worry now that I have gone
I've gone beyond to seek the truth
When you know that your time is close at hand
Maybe then you'll begin to understand
Life down here is just a strange illusion
-Hallowed Be Thy Name
--Iron Maiden

When all falls down, when Satan's calling
Blood will flow when hell is crawling
Majesty, oh majesty
Majesty, dark majesty
--Majesty
-Gamma Ray

The Devil has found an amazing playground
And he will enjoy playing games
Nothing is sacred, nothing is holy
Run to the exit again if you can
--Majesty
-Gamma Ray

A nightmare awakes me, blinking light,
there's no guide - blind ships in the night!
Oh, blood red moon, eat away the night...
-White Pearl, Black Oceans
--Sonata Arctica

Eleanor Rigby, died in the church
And was buried along with her name
Nobody came

Father McKenzie, wiping the dirt
From his hands as he walks from the grave
No one was saved
-Eleanor Rigby
--The Beatles


Stygian gramarye, etched with blasphemy,
Whorls and verticils, black with baleful spells,
Vespertine conjurings, doomsayer's prophecy,
Pellucid lotus-dreams, spawn of the elder fiends,
Cryptic halls, squamous mass, malevolent diabolist,
Black desire, nighted woe, shunned and forbidden tome,
Brooding dark, deepest night, ritual, abhorrent sight,
Whispering, malignity, hearken to the summoning!
-Six Score And Ten Oblations To A Malefic Avatar
--Bal-Sagoth

Onwards with our spear-heads gleaming,
Meet them with cold steel a'cleaving,
Fall only when our hearts cease beating,
Men of Hyperborea!
-The Dark Liege Of Chaos Is Unleashed At The Ensorcelled Shrine Of A'Zura-Kai (The Splendour Of A Thousand Swords Gleaming Beneath The Blazon Of The Hyperborean Empire Part II)
--Bal-Sagoth

Proudly it stands
Until the world's end
The victorious banner of love
-The Maiden And The Minstrel Knight
--Blind Guardian

Runes of a long forgotten time, ancient spells in endless rhymes
Soon the other world appears
Roam to the ghostly river Rhine, leave the misty shades behind
I can feel I'm getting near
-Blood On My Hands
--Demons & Wizards

The blood on my hands you see
Can not be washed away
I am chosen by destiny
To dwell in misery
-Blood On My Hands
--Demons & Wizards

Panic and agony hang in the cold air
As we're heading towards our destiny
The figurehead is going down towards the black end
Never to be seen again crossing the seven seas
Clashing waves are our tragic requiem
Since the maiden voyage was the last to be
-Royal Galley
--Falconer

Tear down the wall
Let silence and madness reign
There is no future nor the past
Let us dwell in agony
-Tear Down The Wall
--Demons & Wizards

The void seems like a cold asylum
I search for the last leaf
Hope, how I can find the answers
If all guardian angels are gone?
-Tear Down The Wall
--Demons & Wizards

Coming through the waves to free all the captives
Boarding the vessels, we know all the tactics
We're the menace, the curse of the sea
We pulverize the men o' war pay or flee
-Under Jolly Roger
--Running Wild

Axes grind and maces clash
As wounded fighters fall to the ground
Severed limbs and fatal woundings
Bloody corpses lay all around
-Invaders
--Iron Maiden

Lord above why don't you tell me
why I'm here in agony?
I've been serving, I've been praying
now I'm caught in misery.
-Reach Out For The Light
--Avantasia

Gods of thunder, fire and rain
Cut into the earth till none shall remain
Sons of demons I command you to fly
Ride on from hell into the sky
We'll fight until we die
-Fight Until We Die
--Manowar

There's no sight of the mornin' comin'
There's no sign of the day
You've been left on your own
Like a rainbow
Like a rainbow in the dark
-Rainbow In The Dark
--Dio

Can't you see all the souls
How they suffer and howl
In our eternal pain.
Service taking its toll, living life in Hades...
-The Final Sacrifice
--Avantasia


I see the demons rising, beyond their sleeping void
Deep and down the masters take them to the light
Their piercing rays are blazing, obliterating fast
All dreams are torn to pieces, vaporized at last
-Heart Of The Unicorn
--Gamma Ray

I won't believe in their justice
I won't be trapped once again
Death to the ones who slave minds
Strength and honor to all who will fight
Pride and glory to all survivors
-Change Your Life Line
--Hibria

Torches blazed and sacred chants were praised
As they start to cry hands held to the sky
In the night the fires burning bright
The ritual has begun, Satan's work is done
-The Number Of The Beast
--Iron Maiden

This can't go on, I must inform the law
Can this still be real or just some crazy dream
But I feel drawn towards the chanting hordes
Seem to mesmerize me, can't avoid their eyes
-The Number Of The Beast
--Iron Maiden

I'm coming back, I will return
And I'll possess your body's and I'll make you burn
I have the fire, I have the force
I have the power to make my evil take it's course
-The Number Of The Beast
--Iron Maiden

It's up to us now to seal his fate
Marked with the proper math the child's none too late
Blessed by the Beast, our Chosen One was born this day
He'll rise from the ashes of our dying race
Manipulate history, time and space
The Elder, Men of the Watch, professed this day
-Birth Of The Wicked
--Iced Earth

Blind can see the sun, cripples walk alone
Deaf can hear my words, they believe, just believe
They believe in me, look, the signs are near
To perform my task, to perform my way
To perform the way I walked, way of the crucifix
-Banish from Sanctuary
--Blind Guardian

What’s yours is mine and what’s mine is mine too
If you shake my hand better count your fingers
-Dread And The Fugitive Mind
--Megadeath

Ah ah ahh ah, ah ah ahh ah
We come from the land of the ice and snow
From the midnight sun where the hot springs blow
The hammer of the gods will drive our ships to new land
To fight the horde and sing and cry, "Valhalla, I am coming"
-Immigrant Song
--Led Zeppelin

Hearken to the mountain
Can you hear the echoes
Of the hammer's beat
From deep within the shadows?

With wisdom and sorcery
From the beginning of time
Magnificent works are forged
For gods and for mighty kings

Uncrushable shields
Power belts and magic rings
Swords that never miss
Scepters and crowns, and other things

There is a holy presence in his hidden existence
Listen to the hymn, it sings in the galleries
Powerful runes, he carves into the shining steel
To have protection from the powers of mystery

-Lord Of The Blacksmiths
--Falconer


I've got electric light
And I've got second sight
I got amazing powers of observation
-Nobody Home
--Pink Floyd
